<?php
	/* /////////////////////////////////////////////////////
	//		見積受注管理パッケージ（受注履歴）
	//////////////////////////////////////////////////////*/
	
	////////////////////////////////////////////////////////
	//
	//	#substance	パッケージの作成
	//  #Date		2013/12/13
	//	#Author 	yk
	//
	////////////////////////////////////////////////////////
	
//--------------------------------------------------------------------
	
	class Accept {
		
		///--------------------------------------------------------------------
		/// 【コンストラクター】
		///
		/// 戻り値　なし
		///
		///	#Author yk
		/// #date	2013/12/13
		///--------------------------------------------------------------------
		function __construct(){
		}
		
		///--------------------------------------------------------------------
		/// 見積受注情報の新規保存
		///
		/// #param  $post：フォームの入力情報
		///
		///	#Author yk
		/// #date	2013/12/13
		///--------------------------------------------------------------------
		function insertEstimateAccept($post){
			global $mydb;
			$edit_date = date("Y-m-d H:i:s");
			$sql = "INSERT INTO ".
				   "       ACCEPT_MASTER ".
				   "VALUES('',".
				   "       '".$post['cliant_id']."', ".
				   "       '".$post['staff_id']."', ".
				   "       '".$post['estimate_id']."', ".
				   "       '".$post['accept_date']."', ".
				   "       '".$post['limit_date']."', ".
				   "       '".$post['title']."', ".
				   "       '".$post['price']."', ".
				   "       '".$post['notes']."', ".
				   "       '', ".
				   "       '".$edit_date."', ".
				   "       '".$edit_date."');";
			$res = mysql_query($sql, $mydb);
			if($res){
				return 'insert-ok';
			}
			else{
				echo $sql;
				return 'insert-ng';
			}
		}
	}
?>